//
// 스프라이트 시트 만들기
// ㄴ 포토샵 그리드(격자표시)를 배경에 만들고 기준점에 맞춰서 
// ㄴ 한장의 비트맵으로 만들기
// ㄴ 툴만들기보다 보스, 플레이어 전부 포토샵으로 편집
// 
// 유한 상태 기계 (Finite State Machine)
// ㄴ 컴퓨터 설계에 상태를 부여(게임의 shoot, run, idle등등)
// ㄴ 상태로 구분해서 동작하나하나 설계 및 접근
// 
// 대각선이동시 속도가 다름 
// ㄴ 대각선의 길이를 구해서 나눔
// 
// 애니메이션 오프셋인자
// ㄴ 전달받은 좌표에서 비트맵그림
// 트랜스폼 mScale 구현
// 
// CreateAnimations 스프라이트로 애니메이션 제작
// 파일시스템 라이브러리
// ㄴ 파일 입출력을 관리해주는 라이브러리
// ㄴ <filesystem>
// 
// 파일 입출력 라이브러리로 폴더내부 이미지파일을 벡터로 저장하고
// 스프라이트 사이즈가 제각각이라면 가장큰 스프라이트 기준으로
// 폴더내 존재하는 스프라이트 갯수만큼 가로로 이어주어 하나의 스프라이트 시트여백지를 만든다
// 벡터안에 있는 이미지들을 간격에 맞춰 스프라이트 시트에 복사해준다.
// 
//