
#include <iostream>

// 메세지 처리 기반 방식은 게임제작에 적합하지않다.
// 메세지가 들어 올때만 처리되기 때문에 일정한 타이밍으로 반복적으로 메세지가
// 들어오도록 설계해야한다.

//namespace 사용이유 대중적인 이름을 사용하기위해서

// 폴더 및 헤더파일 정리
// engine- common- 자주쓰는 헤더파일 및 열거체 정리

// 프로젝트 속성 - 일반 - c++ 언어 표준 -> 20버전으로 바꾸기 
// 문법들이 추가됨

// Vector 벡터
// 크기와 방향을 표현가능한 점(좌표)
// 벡터가 적용된곳( pdf파일 - 이미지를 확대해도 깨지지않음)

// Scene 씬
// 게임 레벨(타이틀, 플레이, 엔딩 등등)로 구분
// 윈도우(어플리케이션)에서는 idmabout, 툴같은 보조기능을 사용하기때문에
// 씬매니저 클래스에서 관리 

// Component 컴포넌트
// 클래스에 주먹구구식으로 필요한 기능을 추가하면 몸집이 큰 게임을 제작할때는
// 좋지않다.
// 유니티 컴포넌트 기능 - 필요한 기능만 상속받아서 가상함수로 사용

int main()
{

	return 0;
}