//
// 충돌 매니저
// 유니티 레이어 기반 충돌 체크 스타일 
// ㄴ 비트단위로 실시간으로 레이어 체크
// ㄴ WORD - unsigned short 2바이트 = 16비트
// ㄴ 16개의 비트로 on/ off용도로 사용
// 
// 비트연산자
// & - AND연산자 - 두 비트가 1이면 1을 반환
// | - OR연산자 - 두 비트중 하나라도 1이면 1반환
// ^ - 대응되는 비트가 서로 다르면 1을 반환함. (비트 XOR 연산)
// ~ - 비트를 1이면 0으로, 0이면 1로 반전시킴. (비트 NOT 연산)
// << 지정한 수만큼 비트들을 전부 왼쪽으로 이동시킴. (left shift 연산)
// >> 부호를 유지하면서 지정한 수만큼 비트를 전부 오른쪽으로 이동시킴. (right shift 연산)
// 
// 충돌체크 방식
// ㄴ 씬에 존재하는 모든 오브젝트들이 레이어에 대조하며 하나씩 순회해야함
// 
// 네모 히트박스끼리 충돌
// 1. 히트박스의 네 꼭지점 중 하나가 다른 히트박스 안에 들어가있을때 체크
// 2. 중점간의 거리와 각 면적(x,y)의 절반의 길이를 비교 체크
// 
// 원 충돌
// ㄴ 중점간의 거리보다 두 원의 반지름의 길이의 합이 클때 충돌 체크
// 
// 
// 이미지 스케일
// ㄴ 포토샵으로 크기 지정 ㄴㄴ 
// ㄴ 트랜스폼 컴포넌트 스케일로 조정 (원본에서)
//